def num_by_num(x):
    num = 0
    if n in d.keys():
        return d.get(n)
    else:
        l = n.split(" ")
        for i in l:
            num += d.get(i)
    return num



d = {
    "ноль": 0, "один": 1, "два": 2, "три": 3,
    "четыре": 4, "пять": 5, "шесть": 6, "семь": 7,
    "восемь": 8, "девять": 9, "десять": 10, "одиннадцать": 11,
    "двенадцать": 12, "тринадцать": 13, "четырнадцать": 14,
    "пятнадцать": 15, "шестнадцать": 16, "семнадцать": 17,
    "восемнадцать": 18, "девятнадцать": 19, "двадцать": 20,
    "тридцать": 30, "сорок": 40, "пятдесят": 50,
    "шестьдесят": 60, "семдесят": 70, "восемьдесят": 80,
    "девяносто": 90, "сто": 100
    }

n = input("Введите число: ")
print(num_by_num(n))
